Tekla.Structures.Plugins.DrawingPluginBase.DefineInput
The method Tekla Structures calls for the plug-in to query the input.
The plug-in must then return an array list of input definition instances. The plug-in
will be dependent on the items it returns. Dependent means that if any of these
items change, for example the user moves the points, the plug-in will be re-run with new
input. DefineInput is not called during the re-run, and thus all the actual implementation
should be in the Run() method.
Returns: An array list of input definition instances. If the plug-in is not dependent on input, it
should return an empty array list (not null).